Rossano/Peltier_STM32F4/Project/Core/Src/main.cpp
/******************************************************************************
 *
 * @brief     This file is part of the TouchGFX 4.8.0 evaluation distribution.
 *
 * @author    Draupner Graphics A/S <http://www.touchgfx.com>
 *
 ******************************************************************************
 *
 * @section Copyright
 *
 * This file is free software and is provided for example purposes. You may
 * use, copy, and modify within the terms and conditions of the license
 * agreement.
 *
 * This is licensed software for evaluation use, any use must strictly comply
 * with the evaluation license agreement provided with delivery of the
 * TouchGFX software.
 *
 * The evaluation license agreement can be seen on www.touchgfx.com
 *
 * @section Disclaimer
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Draupner Graphics A/S has
 * no obligation to support this software. Draupner Graphics A/S is providing
 * the software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Draupner Graphics A/S can not be held liable for any consequential,
 * incidental, or special damages, or any other relief, or for any claim by
 * any third party, arising from your use of this software.
 *
 *****************************************************************************/

#include <touchgfx/hal/HAL.hpp>
#include <touchgfx/hal/BoardConfiguration.hpp>

using namespace touchgfx;

//#include "timer.h"

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "stm32f4xx_hal.h"
#include "gpio.h"
#include "usbd_cdc_if.h"
#include "timer.h"
#include "adc.h"
#include "dma.h"
#include "PeltierApplication.h"
#include "shell.hpp"

#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "usbd_conf.h"
#include "usbd_desc.h"
#include "core_cm4.h"

#include <stdio.h>
#include "main.h"

#include <gui\model\Model.hpp>
/**
 * Define the FreeRTOS task priorities and stack sizes
 */
#define configGUI_TASK_PRIORITY                 ( tskIDLE_PRIORITY + 3 )

#define configGUI_TASK_STK_SIZE                 ( 1024 )

#if 0
/** @defgroup TIM_AutoReloadPreload TIM Auto-Reload Preload
  * @{
  */
#define TIM_AUTORELOAD_PRELOAD_DISABLE                0x00000000U               /*!< TIMx_ARR register is not buffered */
#define TIM_AUTORELOAD_PRELOAD_ENABLE                 TIM_CR1_ARPE              /*!< TIMx_ARR register is buffered */
#endif

//#define VSENSE									( 3.3f / 1023 )
//#define USE_USB

/*uint8_t usb_cdc_rx_char;
cdc_buf_t usb_cdc_buffer;
uint8_t newCmd;
uint8_t new_char_on_usb; */
QueueHandle_t xUsb_tx, xUsb_rx;

#if 0
uint16_t adcBuffer[ADC_CHANNELS];

extern ADC_HandleTypeDef hadc1;
extern DMA_HandleTypeDef hdma_adc1;
#endif

//extern void MX_TIM8_Init();

#if 0
extern TIM_HandleTypeDef htim8;
extern TIM_HandleTypeDef htim9;

void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef* htim_base);
void HAL_TIM_MspPostInit(TIM_HandleTypeDef* htim_base);
#endif

static void GUITask(void* params)
{
    touchgfx::HAL::getInstance()->taskEntry();
}

#if 0
static void ShellTask(void *p)
{
	appli->shell->vShellThread((void *)ShellCommand);
/*	cdc_buf_t line;
	for(uint8_t i=0; i<sizeof(cdc_buf_t); i++) line[i] = 0;
	while (true)
	{
		BaseType_t xStatus;
		xStatus = xQueueReceive(xUsb_rx, &line, 100);
		if(xStatus != pdPASS)
		{
			// ERROR
		}
		// Check if there was a message awaiting or it was just a timeout
		if(line[0] != 0)
		{
			// Calls the shell task
			appli->shell->ShellTask(p, (char *)line);
		}
	}*/
}

static void xStartDefaultTask(void * argument)
{
  /* init code for USB_HOST */
//  MX_USB_HOST_Init();

  uint8_t pos = 0;
  const TickType_t ticks = pdMS_TO_TICKS(50);
  cdc_buf_t buffer;
  cdc_buf_t data_to_send;
/*  xQueueCreate(3, sizeof(cdc_buf_t));
  xQueueCreate(3, sizeof(cdc_buf_t)); */

  /* USER CODE BEGIN 5 */
	  /* init code for USB_DEVICE */
  /* Infinite loop */
//	  uint8_t myBuf[20] = "Ciao Belo\r\n";
  ///
  ///	Print the PROMPT
  ///
  CDC_Transmit_HS((uint8_t*)"\r\nSTM32> ", 9);
  float temperature;
  for(;;)
  {
    //osDelay(1);
#ifdef USE_USB
	  ///
	  /// Task only manage to send the outcoming messages, incoming messages are managed by callback
	  ///

//	  CDC_Transmit_HS(myBuf, sizeof(myBuf));
	  ///
	  /// Handle a new char from USB
	  ///
/*	  if(new_char_on_usb)
	  {
		  for(uint8_t i=0; i < usb_cdc_rx_char; i++)
		  {
			  if(usb_cdc_buffer[i] == '\r' || usb_cdc_buffer[i] == '\n' || usb_cdc_buffer[i] == '\0' || pos < MAX_BUF_LENGTH)
			  {
				  buffer[pos++] = '0';
				  xQueueSendToBack(xUsb_tx, &buffer, 0);
				  newCmd = true;
				  CDC_Transmit_HS(buffer, pos);
				  break;
			  }
			  else {
				  buffer[pos++] = usb_cdc_buffer[i];
			  }
		  }
		  new_char_on_usb = false;
		  // Clean up the buffer
		  if(newCmd)
		  {
			  for(uint8_t i=0; i < MAX_BUF_LENGTH; i++) buffer[i] = 0;
			  newCmd = false;
		  }
	  }*/
	  ///
	  /// Check if a new message has to be sent to USB and do it
	  ///
	  BaseType_t xStatus;
	  if((xStatus = xQueueReceive(xUsb_rx, &data_to_send,ticks)) == pdPASS)
	  {
		  uint8_t len = 0;
		  while (data_to_send[len] && len < MAX_BUF_LENGTH) len++;
		  CDC_Transmit_HS(data_to_send, len);
		  ///
		  ///	Print the PROMPT
		  ///
		  CDC_Transmit_HS((uint8_t*)"\r\nSTM32> ", 9);
	  }
#endif
//	  HAL_Delay(500);

		  HAL_ADC_Start_DMA(&hadc1, (uint32_t *)adcBuffer, ADC_CHANNELS);
		  temperature  = ((float) adcBuffer[0] / ADC_FULL_SCALE * 3300);
		  msg.peltier = temperature;
		  temperature  = ((float) adcBuffer[2] / ADC_FULL_SCALE * 3300);
		  msg.ext = temperature;
		  msg.pwm = 128;
		  BaseType_t status;
		  if((status = xQueueSend(xLowLevelData, &msg, 0)) == pdTRUE)
		  {

		  }
		  //osDelay(500);
		  HAL_Delay(1500);
  }
  /* USER CODE END 5 */
}
#endif

int _write(int file, char *ptr, int len)
{
  /* Implement your write code here, this is used by puts and printf for example */
  int i=0;
  for(i=0 ; i<len ; i++)
    ITM_SendChar((*ptr++));
  return len;
}

#if 0
//void MX_GPIO_Init(void)
//{
//
//  GPIO_InitTypeDef GPIO_InitStruct = {0};
//
//  /* GPIO Ports Clock Enable */
//  __HAL_RCC_GPIOC_CLK_ENABLE();
//  __HAL_RCC_GPIOF_CLK_ENABLE();
//  __HAL_RCC_GPIOH_CLK_ENABLE();
//  __HAL_RCC_GPIOA_CLK_ENABLE();
//  __HAL_RCC_GPIOB_CLK_ENABLE();
//  __HAL_RCC_GPIOG_CLK_ENABLE();
//  __HAL_RCC_GPIOE_CLK_ENABLE();
//  __HAL_RCC_GPIOD_CLK_ENABLE();
//
//  /*Configure GPIO pin Output Level */
//  HAL_GPIO_WritePin(GPIOC, NCS_MEMS_SPI_Pin|CSX_Pin|OTG_FS_PSO_Pin, GPIO_PIN_RESET);
//
//  /*Configure GPIO pin Output Level */
//  HAL_GPIO_WritePin(ACP_RST_GPIO_Port, ACP_RST_Pin, GPIO_PIN_RESET);
//
//  /*Configure GPIO pin Output Level */
//  HAL_GPIO_WritePin(GPIOD, RDX_Pin|WRX_DCX_Pin, GPIO_PIN_RESET);
//
//  /*Configure GPIO pin Output Level */
//  HAL_GPIO_WritePin(GPIOG, LD3_Pin|LD4_Pin, GPIO_PIN_RESET);
//
//  /*Configure GPIO pins : PCPin PCPin PCPin */
//  GPIO_InitStruct.Pin = NCS_MEMS_SPI_Pin|CSX_Pin|OTG_FS_PSO_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
//
//  /*Configure GPIO pins : PAPin PAPin PAPin PAPin */
//  GPIO_InitStruct.Pin = B1_Pin|MEMS_INT1_Pin|MEMS_INT2_Pin|TP_INT1_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
//
//  /*Configure GPIO pin : PtPin */
//  GPIO_InitStruct.Pin = ACP_RST_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//  HAL_GPIO_Init(ACP_RST_GPIO_Port, &GPIO_InitStruct);
//
//  /*Configure GPIO pin : PtPin */
//  GPIO_InitStruct.Pin = OTG_FS_OC_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  HAL_GPIO_Init(OTG_FS_OC_GPIO_Port, &GPIO_InitStruct);
//
//  /*Configure GPIO pin : PtPin */
//  GPIO_InitStruct.Pin = BOOT1_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  HAL_GPIO_Init(BOOT1_GPIO_Port, &GPIO_InitStruct);
//
//  /*Configure GPIO pin : PtPin */
//  GPIO_InitStruct.Pin = TE_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  HAL_GPIO_Init(TE_GPIO_Port, &GPIO_InitStruct);
//
//  /*Configure GPIO pins : PDPin PDPin */
//  GPIO_InitStruct.Pin = RDX_Pin|WRX_DCX_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
//
//  /*Configure GPIO pins : PGPin PGPin */
//  GPIO_InitStruct.Pin = LD3_Pin|LD4_Pin;
//  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);
//
//}
#endif

#if 0
//void HAL_TIM_MspPostInit(TIM_HandleTypeDef* htim)
//{
//  GPIO_InitTypeDef GPIO_InitStruct = {0};
//  if(htim->Instance==TIM9)
//  {
//  /* USER CODE BEGIN TIM9_MspPostInit 0 */
//
//  /* USER CODE END TIM9_MspPostInit 0 */
//
//    __HAL_RCC_GPIOE_CLK_ENABLE();
//    /**TIM9 GPIO Configuration
//    PE6     ------> TIM9_CH2
//    */
//    GPIO_InitStruct.Pin = GPIO_PIN_6;
//    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//    GPIO_InitStruct.Pull = GPIO_NOPULL;
//    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//    GPIO_InitStruct.Alternate = GPIO_AF3_TIM9;
//    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
//
//  /* USER CODE BEGIN TIM9_MspPostInit 1 */
//
//  /* USER CODE END TIM9_MspPostInit 1 */
//  }
//
//}
//
///**
//  * @brief TIM8 Initialization Function
//  * @param None
//  * @retval None
//  */
//static void MX_TIM8_Init(void)
//{
//
//  /* USER CODE BEGIN TIM8_Init 0 */
//
//  /* USER CODE END TIM8_Init 0 */
//
//  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
//  TIM_MasterConfigTypeDef sMasterConfig = {0};
//
//  /* USER CODE BEGIN TIM8_Init 1 */
//
//  /* USER CODE END TIM8_Init 1 */
//  htim8.Instance = TIM8;
//  htim8.Init.Prescaler = 48000-1;
//  htim8.Init.CounterMode = TIM_COUNTERMODE_UP;
//  htim8.Init.Period = 1750-1;
//  htim8.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
//  htim8.Init.RepetitionCounter = 0;
//  htim8.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
//  if (HAL_TIM_Base_Init(&htim8) != HAL_OK)
//  {
//    Error_Handler();
//  }
//  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
//  if (HAL_TIM_ConfigClockSource(&htim8, &sClockSourceConfig) != HAL_OK)
//  {
//    Error_Handler();
//  }
//  sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;
//  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
//  if (HAL_TIMEx_MasterConfigSynchronization(&htim8, &sMasterConfig) != HAL_OK)
//  {
//    Error_Handler();
//  }
//  /* USER CODE BEGIN TIM8_Init 2 */
//
//  /* USER CODE END TIM8_Init 2 */
//
//}
//
///**
//  * @brief TIM9 Initialization Function
//  * @param None
//  * @retval None
//  */
//static void MX_TIM9_Init(void)
//{
//
//  /* USER CODE BEGIN TIM9_Init 0 */
//
//  /* USER CODE END TIM9_Init 0 */
//
//  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
//  TIM_OC_InitTypeDef sConfigOC = {0};
//
//  /* USER CODE BEGIN TIM9_Init 1 */
//
//  /* USER CODE END TIM9_Init 1 */
//  htim9.Instance = TIM9;
//  htim9.Init.Prescaler = 32;
//  htim9.Init.CounterMode = TIM_COUNTERMODE_UP;
//  htim9.Init.Period = 525;
//  htim9.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
//  htim9.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
//  if (HAL_TIM_Base_Init(&htim9) != HAL_OK)
//  {
//    Error_Handler();
//  }
//  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
//  if (HAL_TIM_ConfigClockSource(&htim9, &sClockSourceConfig) != HAL_OK)
//  {
//    Error_Handler();
//  }
//  if (HAL_TIM_PWM_Init(&htim9) != HAL_OK)
//  {
//    Error_Handler();
//  }
//  sConfigOC.OCMode = TIM_OCMODE_PWM1;
//  sConfigOC.Pulse = 0;
//  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
//  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
//  if (HAL_TIM_PWM_ConfigChannel(&htim9, &sConfigOC, TIM_CHANNEL_2) != HAL_OK)
//  {
//    Error_Handler();
//  }
//  /* USER CODE BEGIN TIM9_Init 2 */
//
//  /* USER CODE END TIM9_Init 2 */
//  HAL_TIM_MspPostInit(&htim9);
//
//}
#endif

#if 0
/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA2_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA2_Stream0_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);

}
#endif
#if 0
/**
 * 	Enable ADC1
 */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */
  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = ENABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T4_CC4; //ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 3;
  hadc1.Init.DMAContinuousRequests = ENABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SEQ_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }
  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_TEMPSENSOR;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_56CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_5;
  sConfig.Rank = 2;
  sConfig.SamplingTime = ADC_SAMPLETIME_56CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_13;
  sConfig.Rank = 3;
  sConfig.SamplingTime = ADC_SAMPLETIME_56CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

}

void HAL_ADC_MspInit(ADC_HandleTypeDef* adcHandle)
{

  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if(adcHandle->Instance==ADC1)
  {
  /* USER CODE BEGIN ADC1_MspInit 0 */

  /* USER CODE END ADC1_MspInit 0 */
    /* ADC1 clock enable */
    __HAL_RCC_ADC1_CLK_ENABLE();

    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();
    /**ADC1 GPIO Configuration
    PC3     ------> ADC1_IN13
    PA5     ------> ADC1_IN5
    */
    GPIO_InitStruct.Pin = GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* ADC1 DMA Init */
    /* ADC1 Init */
    hdma_adc1.Instance = DMA2_Stream0;
    hdma_adc1.Init.Channel = DMA_CHANNEL_0;
    hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;
    hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hdma_adc1.Init.Mode = DMA_CIRCULAR;
    hdma_adc1.Init.Priority = DMA_PRIORITY_LOW;
    hdma_adc1.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(adcHandle,DMA_Handle,hdma_adc1);

  /* USER CODE BEGIN ADC1_MspInit 1 */
    HAL_NVIC_SetPriority(ADC_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(ADC_IRQn);
  /* USER CODE END ADC1_MspInit 1 */
  }
}
#endif

PeltierApplication *appli = new PeltierApplication();
int main(void)
{
    hw_init();
//    MX_GPIO_Init();
    MX_TIM4_Init();		// 8
    MX_TIM9_Init();
    MX_DMA_Init();
    MX_ADC1_Init();
#ifdef PRINTF_DBG
    printf("Init HW & GPIO\n");
#endif
#ifdef USE_USB
    MX_USB_DEVICE_Init();
    // Create Tx/Rx queues
    xUsb_tx = xQueueCreate(3, sizeof(cdc_buf_t));
    xUsb_rx = xQueueCreate(3, sizeof(cdc_buf_t));
#ifdef PRINTF_DBG
    printf("Init USB\n");
#endif
#endif

    HAL_ADC_MspInit(&hadc1);

    HAL_ADC_Start(&hadc1);
    HAL_ADC_Start_DMA(&hadc1, (uint32_t *)adcBuffer, ADC_CHANNELS);

    touchgfx_init();
#ifdef PRINTF_DBG
    printf("Launched TouchGFF\nNow creating the tasks\n");
#endif

    //PeltierApplication *appli = new PeltierApplication();

    //appli->MX_USB_DEVICE_Init();
    xTaskCreate(xStartDefaultTask, "Default Task", 128, NULL, osPriorityBelowNormal, NULL);
 //   xTaskCreate(xStartDefaultTask, "Default Task", 2048, NULL, 3, NULL);
    xTaskCreate(ShellTask, "Shell Task", 128, NULL, osPriorityNormal+3, NULL);

    xTaskCreate(GUITask, "GUITask",
                configGUI_TASK_STK_SIZE,
                NULL,
                configGUI_TASK_PRIORITY,
                NULL);

    vTaskStartScheduler();

    for (;;);
}

///**
//  * @brief  Period elapsed callback in non blocking mode
//  * @note   This function is called  when TIM6 interrupt took place, inside
//  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
//  * a global variable "uwTick" used as application time base.
//  * @param  htim : TIM handle
//  * @retval None
//  */
//void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
//{
//  /* USER CODE BEGIN Callback 0 */
//
//  /* USER CODE END Callback 0 */
//  if (htim->Instance == TIM6) {
//    HAL_IncTick();
//  }
//  /* USER CODE BEGIN Callback 1 */
//
//  /* USER CODE END Callback 1 */
//}
